{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 120, 160, 1], "name": "conv2d_15", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "activation": "tanh", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "activation": "tanh", "name": "conv2d_16", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_8", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_8", "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "activation": "tanh", "name": "conv2d_17", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "activation": "tanh", "name": "conv2d_18", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_9", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_9", "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "activation": "tanh", "name": "conv2d_19", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "activation": "tanh", "name": "conv2d_20", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_10", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_10", "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "units": 3}}]}